InformationRegisters/Б24_СУ_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Б24_СУ_Настройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПовторенийПриОшибках</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Б24_К_НастройкиПодключения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Б24_СУ_ТаблицаИзменений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Б24_СУ_ТаблицаИзменений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВремяЗаписиВМиллисекундах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Б24_К_НастройкиПодключения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Б24_К_ТипыДанныхДляОбменаСПорталом</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодчиненныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Б24_СУ_Настройки/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СозданаИзмененаНастройка" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы      

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	лПараметры = Новый Структура;
	лПараметры.Вставить("НастройкаПодключения", ВыбраннаяСтрока); 
	ОткрытьФорму("РегистрСведений.Б24_СУ_Настройки.Форма.ФормаЗаписи", лПараметры);
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Настроить(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		лПараметры = Новый Структура;
		лПараметры.Вставить("НастройкаПодключения", ТекущаяСтрока); 
		ОткрытьФорму("РегистрСведений.Б24_СУ_Настройки.Форма.ФормаЗаписи", лПараметры);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Необходимо создать настройку подключения");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыгрузку(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		Если Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеРеквизитаОбъекта(ТекущаяСтрока, "ПометкаУдаления") = Ложь Тогда
			
			Если НЕ НастройкаВыгрузкиСуществует(ТекущаяСтрока) Тогда
				ПоказатьПредупреждение(, "Не заданы настройки выгрузки",10);
				Возврат;
			КонецЕсли;
			
			Если Б24_К_ОбщегоНазначенияВызовСервераПовтИсп.РасширениеВБезопасномРежиме() Тогда
				ПоказатьПредупреждение(, "Расширение модуля в безопасном режиме. Продолжение невозможно",10);
				Возврат;
			КонецЕсли;
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("НастройкаПодключения"	, ТекущаяСтрока);
			ПараметрыФормы.Вставить("ПолнаяВыгрузка"	, Ложь);
			
			ОткрытьФорму("РегистрСведений.Б24_СУ_Настройки.Форма.ФормаВыполнениеВыгрузки", ПараметрыФормы, , ТекущаяСтрока);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПолнуюВыгрузку(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		Если Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеРеквизитаОбъекта(ТекущаяСтрока, "ПометкаУдаления") = Ложь Тогда
			
			Если НЕ НастройкаВыгрузкиСуществует(ТекущаяСтрока) Тогда
				ПоказатьПредупреждение(, "Не заданы настройки выгрузки",10);
				Возврат;
			КонецЕсли;
			
			Если Б24_К_ОбщегоНазначенияВызовСервераПовтИсп.РасширениеВБезопасномРежиме() Тогда
				ПоказатьПредупреждение(, "Расширение модуля в безопасном режиме. Продолжение невозможно",10);
				Возврат;
			КонецЕсли;
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("НастройкаПодключения"	, ТекущаяСтрока);
			ПараметрыФормы.Вставить("ПолнаяВыгрузка"		, Истина);
			
			ОткрытьФорму("РегистрСведений.Б24_СУ_Настройки.Форма.ФормаВыполнениеВыгрузки", ПараметрыФормы, , ТекущаяСтрока);
			
		КонецЕсли;
		
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрированныеИзменения(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		ПараметрыВыбора = Новый Структура("НастройкаПодключения", ТекущаяСтрока);
		ОткрытьФорму("РегистрСведений.Б24_СУ_ТаблицаИзменений.ФормаСписка", ПараметрыВыбора, ЭтаФорма);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти


#Область Прочие

&НаСервере
Функция НастройкаВыгрузкиСуществует(НастройкаПодключения)
	
	Возврат РегистрыСведений.Б24_СУ_Настройки.ПолучитьМассивНастроекВыгрузки("НастройкаПодключения", НастройкаПодключения).Количество() > 0;
	
КонецФункции

#КонецОбласти
